[
{
  "title": "QML Torch — Activity One: Conceptual Quantum Layer Experiment",
  "date": "2025-09-18",
  "summary": "Initial experimental lab for QML Torch — explored how quantum superposition and entanglement can conceptually extend classical nonlinear modeling.",
  "summary_long": "<p>This lab marked the first experimental step toward <strong>QML Torch</strong>, focusing on the conceptual interface between classical and quantum representations. The intent was not to optimize performance but to probe structure—to examine how superposition and entanglement can replicate or extend nonlinear transformations found in deep learning. Using <code>PennyLane</code> simulators on a standard laptop, the experiment mapped interference patterns to classical feature space, providing a tangible foundation for later hybrid differentiable circuits integrated with PyTorch autograd. This work defined the architectural language and intuition that will guide future hardware-connected implementations.</p>",
  "notes": "Full lab notes and explanations are available in the project PDF: https://drive.google.com/file/d/1upald5Y7m3GdC2k4gwsqYBcodfCJXAes/view",
  "code": [
    {
      "label": "GitHub Repository",
      "lang": "link",
      "content": "https://github.com/simransummermalik/qml-torch-activity-one"
    }
  ]
},
{
  "title": "Quantum XOR — Visualizing Entanglement and Nonlinearity",
  "date": "2025-10-01",
  "summary": "Conceptual quantum reimagining of the classic XOR problem, inspired by the game XOR — built to show how quantum logic and interference patterns could replicate nonlinearity in ML decision spaces.",
  "summary_long": "<p>This lab extended the ideas behind <strong>QML Torch Activity One</strong> into a direct visual case study using the XOR dataset as both a classical benchmark and a conceptual testing ground for quantum structure. Inspired by the retro game <a href='https://www.crazygames.com/game/xor' target='_blank'>XOR</a>, this project explored how superposition and entanglement can act as information routing mechanisms, mirroring how nonlinear activations and feature crossings behave in classical deep learning.</p><p>Implemented fully on laptop-based simulators using <code>PennyLane</code> and <code>NumPy</code>, the experiment visualized the quantum circuit’s interference landscape as a differentiable decision surface. The focus was not on outperforming classical models, but on understanding how quantum transformations <em>encode logical nonlinearity without explicit activation functions</em>. The outcome served as both a teaching demo and a conceptual bridge toward hybrid layers that merge quantum data reuploading with PyTorch autograd.</p>",
  "notes": "Detailed notes and analysis PDF: https://drive.google.com/file/d/1upald5Y7m3GdC2k4gwsqYBcodfCJXAes/view\nAdditional documentation: 10_1 notes - Google Docs (1) (3).pdf",
  "code": [
    {
      "label": "GitHub Repository",
      "lang": "link",
      "content": "https://github.com/simransummermalik/quantum-xor"
    }
  ]
}
]
